content/journal/2024-08-10.org
---
title: Landing at Dawnfall
date: 2024-08-10T15:44:13-07:00
draft: false
---
* Costume
- Genevieve is going as mind-flayer core, with a lovely little mask
- Edalyn has an activatable beacon to transmit our location to Margaret.
* Meeting the group
- Vatamousee
- We all have a listed arrival time to arrive at the estate gates.
- "I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN"
- It's the tiniest kobold ever, less than three feet.
- Armor adorned with furs and fanged
- Axe taller than they are: Four-headed scaly axe.
- Threatened to eat me
* Estate
- It's the same guy who was piloting our boat.
- I feel off looking at him.
- Something off-putting about him.
- TODO investigate his hat. Supernatural?
* Masquerade
- Grand party, balcony with a view
- Massive dance hall
- Signs: Artists grotto, theatre,
- Probably Margaret heading into the theatre
- Burly half-orc on the second level, who's noticed Zyzyx.
** Confrontation
- Nomble, artist, lizard/frog person
- Nomble knows a lot more than he's letting on about me.
- Nomble lead me to a closed door, and is referencing the kindly lord's artifact collection
*** Planning
- Read thoughts?
- What do you do?
- What brings you here?
- Do you work with the kindly lord
- Attempt to sus out if he's an agent/affiliate of the kindly lord
- What's a good euphemism for "thief"? "Finder"
- I have my book. Show Nomble the book, leaf through some pages, see how they react.
**** Answers
- Nomble
- They seem friendly. No hostility.
** Milvari
- Angry half-orc
- Sparring with Zyzyx
*** Artists Grotto
- Sulky drow
** Grand library
- He had a blinkstone. One-time teleport gem
- Range: 600 feet.
- Nomble seems friendly, can circumvent Kiordan's wards
- Start doing checks. Honeypots, surveillance?
- Nomble took care of all of them
* Stuff
- Some people plan to cause a ruckus
- Zyzyx, Melvari, Iggly are trying to kill someone in the chaos
- "We think this person killed a lot of people, but nobody seems to remember."
- "They may have brutalised the wrong family"
- "A lot of people went missing and no one remembers, the lord of dawnfall seems to have a lot to answer for."
- Fennec saw the whole thing.
** Game
- Vatamousse shoved Nomble into a bag
- The Clean Slate has been tainted.
- Necril text on parchment
- Some mention of a massacre of throllgate?
- Same document referring to the clean slate
- So something happened that was erased by the clean slate.
- Someone was able to use the clean slate multiple times, which is unusual.
- Basically, the clean slate is 'depleted'
- So a rite was performed, killed lots of people, and covered it up using the clean slate.
- "Bloodmother"
- Using it would be a mistake
** Kindly Lord's Entrance
- Margaret is Kiordan's wife? WTF
- Someone fanged and well-dressed is attacking some rando in a black cloak, wearing an insignia of some kind.
- Grab the clean slate and run
- The slate is cursed, so now I'm cursed.
- Adriana: Vampire lord, killed me, I got turned by Margaret

** Mosquito Witch
- We need to get to her to figure out and stop what's going on
- We need to find Womble and the documents
- I'm a vampire and curious about it, Lyn is a vampire and angsty about it.
