public/journal/2024-08-10/index.html
<!DOCTYPE html>
<html lang="en-us">

<head>
  <meta http-equiv="X-Clacks-Overhead" content="GNU Terry Pratchett" />
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0" />
<title>Landing at Dawnfall | Genevieve&#39;s Journal</title>
<meta name="title" content="Landing at Dawnfall" />
<meta name="description" content="Costume Genevieve is going as mind-flayer core, with a lovely little mask Edalyn has an activatable beacon to transmit our location to Margaret. Meeting the group Vatamousee We all have a listed arrival time to arrive at the estate gates. &#34;I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN&#34; It&#39;s the tiniest kobold ever, less than three feet. Armor adorned with furs and fanged Axe taller than they are: Four-headed scaly axe." />
<meta name="author" content="" />
<meta name="keywords" content="" />






  
  <meta property="og:url" content="https://vivianwilde.github.io/blogletters/journal/2024-08-10/">
  <meta property="og:site_name" content="Genevieve&#39;s Journal">
  <meta property="og:title" content="Landing at Dawnfall">
  <meta property="og:description" content="Costume Genevieve is going as mind-flayer core, with a lovely little mask Edalyn has an activatable beacon to transmit our location to Margaret. Meeting the group Vatamousee We all have a listed arrival time to arrive at the estate gates. &#34;I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN&#34; It&#39;s the tiniest kobold ever, less than three feet. Armor adorned with furs and fanged Axe taller than they are: Four-headed scaly axe.">
  <meta property="og:locale" content="en_us">
  <meta property="og:type" content="article">
    <meta property="article:section" content="journal">
    <meta property="article:published_time" content="2024-08-10T15:44:13-07:00">
    <meta property="article:modified_time" content="2024-08-10T15:44:13-07:00">


  
  
  <meta name="twitter:card" content="summary">
  <meta name="twitter:title" content="Landing at Dawnfall">
  <meta name="twitter:description" content="Costume Genevieve is going as mind-flayer core, with a lovely little mask Edalyn has an activatable beacon to transmit our location to Margaret. Meeting the group Vatamousee We all have a listed arrival time to arrive at the estate gates. &#34;I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN&#34; It&#39;s the tiniest kobold ever, less than three feet. Armor adorned with furs and fanged Axe taller than they are: Four-headed scaly axe.">


  
  
  <meta itemprop="name" content="Landing at Dawnfall">
  <meta itemprop="description" content="Costume Genevieve is going as mind-flayer core, with a lovely little mask Edalyn has an activatable beacon to transmit our location to Margaret. Meeting the group Vatamousee We all have a listed arrival time to arrive at the estate gates. &#34;I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN&#34; It&#39;s the tiniest kobold ever, less than three feet. Armor adorned with furs and fanged Axe taller than they are: Four-headed scaly axe.">
  <meta itemprop="datePublished" content="2024-08-10T15:44:13-07:00">
  <meta itemprop="dateModified" content="2024-08-10T15:44:13-07:00">
  <meta itemprop="wordCount" content="505">

<meta name="referrer" content="no-referrer-when-downgrade" />

  
  <link href="/blogletters/original.min.css" rel="stylesheet">

  

  

  
</head>

<body>
  <header><a class="skip-link" href="#main-content">Skip to main content</a>

<a href="/blogletters/" class="title"><h1>Genevieve&#39;s Journal</h1></a>
<nav>
  <a href="/blogletters/journal">Journal</a>

  <a href="/blogletters/about">About</a>









</nav>
</header>
  <main id="main-content">

<h1>Landing at Dawnfall</h1>
<p class="byline">
  <time datetime='2024-08-10' pubdate>
    2024-08-10
  </time>
  
</p>

<content>
  
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Costume
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ul>
<li>Genevieve is going as mind-flayer core, with a lovely little mask</li>
<li>Edalyn has an activatable beacon to transmit our location to Margaret.</li>
</ul>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Meeting the group
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<ul>
<li>Vatamousee</li>
<li>We all have a listed arrival time to arrive at the estate gates.</li>
<li>&#34;I AM ZYZYX THE WINTER STORM DESTROYER OF WORLDS EATER OF CHILDREN&#34;</li>
<li>It&#39;s the tiniest kobold ever, less than three feet.</li>
<li>Armor adorned with furs and fanged</li>
<li>Axe taller than they are: Four-headed scaly axe.</li>
<li>Threatened to eat me</li>
</ul>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Estate
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<ul>
<li>It&#39;s the same guy who was piloting our boat.</li>
<li>I feel off looking at him.</li>
<li>Something off-putting about him.</li>
<li>TODO investigate his hat. Supernatural?</li>
</ul>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
Masquerade
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<ul>
<li>Grand party, balcony with a view</li>
<li>Massive dance hall</li>
<li>Signs: Artists grotto, theatre,</li>
<li>Probably Margaret heading into the theatre</li>
<li>Burly half-orc on the second level, who&#39;s noticed Zyzyx.</li>
</ul>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Confrontation
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<ul>
<li>Nomble, artist, lizard/frog person</li>
<li>Nomble knows a lot more than he&#39;s letting on about me.</li>
<li>Nomble lead me to a closed door, and is referencing the kindly lord&#39;s artifact collection</li>
</ul>
<div id="outline-container-headline-6" class="outline-4">
<h4 id="headline-6">
Planning
</h4>
<div id="outline-text-headline-6" class="outline-text-4">
<ul>
<li>Read thoughts?</li>
<li>What do you do?</li>
<li>What brings you here?</li>
<li>Do you work with the kindly lord</li>
<li>Attempt to sus out if he&#39;s an agent/affiliate of the kindly lord</li>
<li>What&#39;s a good euphemism for &#34;thief&#34;? &#34;Finder&#34;</li>
<li>I have my book. Show Nomble the book, leaf through some pages, see how they react.</li>
</ul>
<div id="outline-container-headline-7" class="outline-5">
<h5 id="headline-7">
Answers
</h5>
<div id="outline-text-headline-7" class="outline-text-5">
<ul>
<li>Nomble</li>
<li>They seem friendly. No hostility.</li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Milvari
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<ul>
<li>Angry half-orc</li>
<li>Sparring with Zyzyx</li>
</ul>
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
Artists Grotto
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<ul>
<li>Sulky drow</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-10" class="outline-3">
<h3 id="headline-10">
Grand library
</h3>
<div id="outline-text-headline-10" class="outline-text-3">
<ul>
<li>He had a blinkstone. One-time teleport gem</li>
<li>Range: 600 feet.</li>
<li>Nomble seems friendly, can circumvent Kiordan&#39;s wards</li>
<li>Start doing checks. Honeypots, surveillance?</li>
<li>Nomble took care of all of them</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-2">
<h2 id="headline-11">
Stuff
</h2>
<div id="outline-text-headline-11" class="outline-text-2">
<ul>
<li>Some people plan to cause a ruckus</li>
<li>Zyzyx, Melvari, Iggly are trying to kill someone in the chaos</li>
<li>&#34;We think this person killed a lot of people, but nobody seems to remember.&#34;</li>
<li>&#34;They may have brutalised the wrong family&#34;</li>
<li>&#34;A lot of people went missing and no one remembers, the lord of dawnfall seems to have a lot to answer for.&#34;</li>
<li>Fennec saw the whole thing.</li>
</ul>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Game
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<ul>
<li>Vatamousse shoved Nomble into a bag</li>
<li>The Clean Slate has been tainted.</li>
<li>Necril text on parchment</li>
<li>Some mention of a massacre of throllgate?</li>
<li>Same document referring to the clean slate</li>
<li>So something happened that was erased by the clean slate.</li>
<li>Someone was able to use the clean slate multiple times, which is unusual.</li>
<li>Basically, the clean slate is &#39;depleted&#39;</li>
<li>So a rite was performed, killed lots of people, and covered it up using the clean slate.</li>
<li>&#34;Bloodmother&#34;</li>
<li>Using it would be a mistake</li>
</ul>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Kindly Lord&#39;s Entrance
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<ul>
<li>Margaret is Kiordan&#39;s wife? WTF</li>
<li>Someone fanged and well-dressed is attacking some rando in a black cloak, wearing an insignia of some kind.</li>
<li>Grab the clean slate and run</li>
<li>The slate is cursed, so now I&#39;m cursed.</li>
<li>Adriana: Vampire lord, killed me, I got turned by Margaret</li>
</ul>
</div>
</div>
<div id="outline-container-headline-14" class="outline-3">
<h3 id="headline-14">
Mosquito Witch
</h3>
<div id="outline-text-headline-14" class="outline-text-3">
<ul>
<li>We need to get to her to figure out and stop what&#39;s going on</li>
<li>We need to find Womble and the documents</li>
<li>I&#39;m a vampire and curious about it, Lyn is a vampire and angsty about it.</li>
</ul>
</div>
</div>
</div>
</div>

</content>
<p>
  
</p>




  </main>
  <footer><small>
   | 
</small></footer>

    
</body>

</html>
